
//Задача 1: Напишите программу, которая бесконечно запрашивает целые числа с консоли. 
//Программа завершается при вводе символа ‘q’ или при вводе числа,
// сумма цифр которого чётная.

Console.WriteLine("Entered 'q' for exit or  any numbers whos sum  even :");
Console.Read();


string numbers(int num)
{
    int n = Convert.ToInt32(Console.ReadLine());



    while (n != q)
    {
    
        int count = 0;

        for (int i = 0; i < n.Length; ++i)
        {
        if (n[i] %)
        }
    }

}





int Count(int n)
{
    int count;
    int reminder;
    for (int i = 0; i < n.length; i++)
    {
        ++count;
    }
    if (count == 1)
    {
        
        reminder = n[i] % 2;
    }

}