//Задача 1: Напишите программу, которая бесконечно запрашивает целые числа с консоли. 
//Программа завершается при вводе символа ‘q’ или при вводе числа,
// сумма цифр которого чётная.

System.Console.WriteLine("Entered 'q' for exit or  any numbers whos sum  even :");